
// ============================================================================
// Bootloader
// ----------------------------------------------------------------------------

"Clover_title" = "Clover EFI";
"Clover_description" = "Clover EFI는 3개의 기본 파일이 필요합니다. (간단한 용어로 설명하였습니다.)
boot0 (드라이브의 MBR에 위치)은 boot1을 읽어 들입니다.
boot1 (파티션의 boot-sector에 위치)은 boot2를 찾습니다.
boot2 (파티션의 root directory에 위치)는 /EFI/BOOT/CLOVERIA32.efi 또는 CLOVERX64.efi, 그리고 kernel 등을 읽어 들입니다.";

"boot0_title" = "1. BIOS방식 MBR boot0 (HFS+Fat32)";
"boot0_description" = "BIOS방식 마더보드에서 BIOS 부팅을 할 경우 선택하십시오.
이 패키지는 fdisk440을 사용하여 MBR의 맨 앞자리에 있는 440비트에 boot0을 설치합니다. Windows가 먼저 설치되어 있어도 지우지 않습니다. boot0가 설치되고 나면 boot0는 첫번째 활성 파티션에서 HFS 파티션이면 boot1h2를, Fat32 파티션이면 boot1f32alt를 각각 검색합니다.

이 패키지는 사용자가 선택한 HFS + Fat32 파티션을 활성 상태로 설정합니다.

설치를 계속 진행하기 전에, 설치 대상 디스크를 윈도우PC에서는 Fat32로, Mac에서는 다음처럼 포맷해야 합니다.

  1. 먼저, 디스크유틸리티에서 MS-DOS (FAT) 포맷으로 지우기 하십시오.
  2. 터미널에서 다음 순서대로 입력합니다.(rdisk9s1은 예제입니다. 자신의 상황에 맞는 IDENTIFIER를 입력하십시오.)
  3. diskutil list
  4. diskutil unmount /dev/rdisk9s1
  5. newfs_msdos -v Fat32 -F 32 /dev/rdisk9s1
  6. diskutil mount /dev/rdisk9s1";

"boot0hfs_title" = "1. BIOS방식 MBR boot0hfs (HFS+Fat32)";
"boot0hfs_description" = "BIOS방식 마더보드에서 BIOS 부팅을 할 경우 선택하십시오.
이 패키지는 fdisk440을 사용하여 MBR의 맨 앞자리에 있는 440비트에 boot0hfs를 설치합니다. Windows가 먼저 설치되어 있어도 지우지 않습니다. boot0가 설치되고 나면 boot0는 첫번째 활성 파티션에서 HFS 파티션이면 boot1h2를, Fat32 파티션이면 boot1f32alt를 각각 검색합니다.

이 패키지는 사용자가 선택한 HFS 파티션은 활성 상태로 설정하지 않으며 Fat32 파티션은 활성 상태로 설정합니다.

설치를 계속 진행하기 전에, 설치 대상 디스크를 윈도우PC에서는 Fat32로, Mac에서는 다음처럼 포맷해야 합니다.

  1. 먼저, 디스크유틸리티에서 MS-DOS (FAT) 포맷으로 지우기 하십시오.
  2. 터미널에서 다음 순서대로 입력합니다.(rdisk9s1은 예제입니다. 자신의 상황에 맞는 IDENTIFIER를 입력하십시오.)
  3. diskutil list
  4. diskutil unmount /dev/rdisk9s1
  5. newfs_msdos -v Fat32 -F 32 /dev/rdisk9s1
  6. diskutil mount /dev/rdisk9s1";

"boot0EFI_title" = "1. BIOS방식 GPT EFI (HFS+Fat32)";
"boot0EFI_description" = "BIOS방식 마더보드에서 BIOS 부팅을 할 경우 선택하십시오.
이 패키지는 fdisk440을 사용하여 MBR의 맨 앞자리에 있는 440비트에 boot0hfs를 설치합니다. Windows가 먼저 설치되어 있어도 지우지 않습니다. boot0가 설치되고 나면 boot0는 활성 상태인 첫번째 GPT EFI 파티션에서 boot1h2, 또는 boot1f32alt를 검색합니다.

이 패키지는 사용자가 선택한 파티션을 활성 상태로 설정하지 않습니다.

설치를 계속 진행하기 전에, 설치 대상 EFI를 HFS(맥인 경우)로 포맷하려면 터미널에 다음을 입력합니다.(rdisk9s1은 예제입니다. 자신의 상황에 맞는 IDENTIFIER를 입력하십시오.)

  diskutil list
  newfs_hfs -v EFI /dev/rdisk9s1

아니면 EFI를 처음부터 맥에서 Fat32로 포맷하기 위해 터미널에 다음을 입력합니다.(rdisk9s1은 예제입니다. 자신의 상황에 맞는 IDENTIFIER를 입력하십시오.)

  diskutil list
  newfs_msdos -v EFI -F 32 /dev/rdisk9s1";

"boot1no_title" = "1. 패키지 압축만 풀기";
"boot1no_description" = "BIOS방식 마더보드에서 BIOS 부팅을 할 경우 선택하십시오.
boot0, boot0hfs, boot0md, boot1h2, boot1f32alt 중에서 아무 것도 설치하지 마십시오.
4kb 하드디스크에 직접 설치할 경우 이 패키지를 선택하십시오.";

"boot1UEFI_title" = "1. UEFI방식 부팅 (UEFI 마더보드)";
"boot1UEFI_description" = "UEFI방식 마더보드에서 UEFI부팅을 할 경우 선택하십시오.
boot0, boot0hfs, boot0md, boot1h2, boot1f32alt 중에서 아무 것도 설치하지 마십시오.

이 패키지는 UEFI부팅을 위해 /EFI/drivers32폴더와 /EFI/drivers64폴더에 몇몇 드라이브를 설치합니다.

부팅을 직접 UEFI부팅으로 설정해야 합니다.:
UEFI -> /EFI/BOOT/CloverX64.efi -> boot.efi -> OS X";

"boot32_title" = "2. 32비트 부트 설치 및 시작으로 설정";
"boot32_description" = "32비트 부트 파일을 설치하며 먼저 32비트로 부팅하게 설정합니다.
기본 설정 부트 = Clover EFI 32bit.
다른 부트 순서를 원하면, 다음 숫자 가운데 하나를 누르십시오.
숫자 1을 누르면 boot1으로 부팅 = Chameleon 부트,
숫자 3을 누르면 boot3으로 부팅 = Clover EFI 32비트 부트,
숫자 6을 누르면 boot6으로 부팅 = Clover EFI 64비트 부트.";

"boot64_title" = "2. 64비트 부트 설치 및 시작으로 설정";
"boot64_description" = "64비트 부트 파일을 설치하며 먼저 64비트로 부팅하게 설정합니다.
기본 설정 부트 = Clover EFI 64비트.
다른 부트 순서를 원하면, 다음 숫자 가운데 하나를 누르십시오.
숫자 1을 누르면 boot1으로 부팅 = Chameleon 부트,
숫자 3을 누르면 boot3으로 부팅 = Clover EFI 32비트 부트,
숫자 6을 누르면 boot6으로 부팅 = Clover EFI 64비트 부트.";

// ============================================================================
// Themes
// ----------------------------------------------------------------------------

"Themes_title" = "테마";
"Themes_description" = "사용자가 원하는 테마를 설치합니다.";

"black_green_title" = "black_green";
"black_green_description" = "기본값. black_green 테마. 만든 사람-Blackosx,
테마 폴더를 /EFI/BOOT/themes/black_green에 설치합니다.";

"buttons_title" = "buttons";
"buttons_description" = "Buttons 테마. 만든 사람-Trauma,
테마 폴더를 /EFI/BOOT/themes/buttons에 설치합니다.";

"hellfire_title" = "hellfire";
"hellfire_description" = "Hellfire 테마. 만든 사람-illevelll,
테마 폴더를 /EFI/BOOT/themes/hellfire에 설치합니다.";

"metal_title" = "metal";
"metal_description" = "The original metal 테마. 만든 사람-Slice,
테마 폴더를 /EFI/BOOT/themes/metal에 설치합니다.";

"simple_gray_title" = "simple_gray";
"simple_gray_description" = "Simple_gray 테마. 만든 사람-hijeane,
테마 폴더를 /EFI/BOOT/themes/simple_gray에 설치합니다.";

"wooden_title" = "wooden";
"wooden_description" = "Wooden 테마. 만든 사람-iROOTa,
테마 폴더를 /EFI/BOOT/themes/wooden에 설치합니다.";

// ----------------------------------------------------------------------------